feat: .io page specific edits
